app/Controllers/Music.php

SELECT *
FROM `music`
---
    public function music()
    {
        $musicModel = new musicModel();
        $music = $musicModel->findAll();

INSERT INTO `music` (`title`, `singer`, `genre`, `date_added`) VALUES ('Fix You', 'Coldplay', 'Metal', '2022-11-11')
---
    public function create()
    {
        $musicModel = new musicModel();
        $musicModel->insert([
            'title' => $this->request->getVar('title'),
            'singer' => $this->request->getVar('singer'),
            'genre' => $this->request->getVar('genre'),
            'date_added' => $this->request->getVar('date_added'),
        ]);

DELETE FROM `music`
WHERE `id` IN ('4')
---
    public function delete ($id)
    {
        $musicModel = new musicModel();
        $musicModel->delete($id);

SELECT *
FROM `music`
WHERE `music`.`id` = '56'
---
    public function edit ($id)
    {
        $musicModel = new musicModel();
        $music = $musicModel->find($id);

UPDATE `music` SET `title` = 'Fix You', `singer` = 'Coldplay', `genre` = 'Pop', `date_added` = '2022-11-11'
WHERE `music`.`id` IN ('57')
---
    public function update ($id)
    {
        $musicModel = new musicModel();
        $newData = [
            'title' => $this->request->getPost('title'),
            'singer' => $this->request->getPost('singer'),
            'genre' => $this->request->getPost('genre'),
            'date_added' => $this->request->getPost('date_added'),
        ];
        $musicModel->update($id, $newData);